demo_project/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "dancing"], ["updated_at", "2023-06-08 18:21:36.608896"], ["id", 3]]
---
    def update
        artwork=Artwork.find(params[:id])

        if artwork.update(artwork_params)

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 3]]
---
    def destroy
        artwork=Artwork.find(params[:id])
        if artwork.delete