demo_project/app/controllers/users_controller.rb

    def index
        if params.has_key?(:query)
            users=User.where("username LIKE '%#{params[:query]}%'")
        else
        users=User.all
---
SELECT "users".* FROM "users" WHERE (username LIKE '%'asm'%')